## Plan Result (nonprod_dynatrace_activegate)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_linux_virtual_machine_scale_set.main[&#34;dynatrace-activegate-test&#34;]
  * azurerm_virtual_machine_scale_set_extension.azuread_login[&#34;dynatrace-activegate-test&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine_scale_set.main["dynatrace-activegate-test"] will be created
  + resource "azurerm_linux_virtual_machine_scale_set" "main" {
      + admin_username                                    = "azureuser"
      + computer_name_prefix                              = (known after apply)
      + custom_data                                       = (sensitive value)
      + disable_password_authentication                   = true
      + do_not_run_extensions_on_overprovisioned_machines = false
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 3
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "dynatrace-activegate-test-nonprod-vmss"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "dynatrace-activegate-nonprod"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D2s_v3"
      + tags                                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/dynatrace-activegate"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "dynatrace-activegate-nonprod-ni"
          + primary                       = true

          + ip_configuration {
              + name      = "internal"
              + primary   = true
              + subnet_id = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Network/virtualNetworks/dynatrace-activegate-vnet-nonprod/subnets/dynatrace-activegate-subnet-0-nonprod"
              + version   = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # azurerm_virtual_machine_scale_set_extension.azuread_login["dynatrace-activegate-test"] will be created
  + resource "azurerm_virtual_machine_scale_set_extension" "azuread_login" {
      + auto_upgrade_minor_version   = true
      + failure_suppression_enabled  = false
      + id                           = (known after apply)
      + name                         = "AADSSHLoginForLinux"
      + publisher                    = "Microsoft.Azure.ActiveDirectory"
      + type                         = "AADSSHLoginForLinux"
      + type_handler_version         = "1.0"
      + virtual_machine_scale_set_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"nonprod_dynatrace_activegate","Vars":{}} -->